<template>
  <BlogLayout>
    <p>
      小程序自从出来之后就挺火的，到目前为止小程序的数量已经非常可观了，各个平台都推出了自己的小程序。那么，如果要做一个新项目，我们是否应该考虑开发小程序呢？或者，已有的项目有没有必要改造成小程序？
    </p>
    <h3>跨平台</h3>
    <p>
      很多小团队和创建公司选择小程序，一个关键原因就是成本低，相比开发安卓和IOS两个版本的app，小程序要容易的多，一套程序运行在多个平台。然而，要跨平台为什么不用
      html5 呢？几乎所有的操作系统都支持，你甚至可以在 switch
      的内置浏览器中浏览网页。而小程序是需要依赖于微信才可以运行的，linux 用户表示与我无关。
    </p>
    <p>所以，要论跨平台，首选 html5 ，真正的一码多端。</p>
    <h3>开发效率</h3>
    <p>
      微信小程序官方提供了开发工具，但是并不太好用，一般都是要配置 vscode
      安装插件来开发，像我使用的是 intellij idea
      ，安装插件来支持小程序的代码提示，然后在微信开发者工具上预览。工具上的问题倒不大，代码提示该有的都有了，开发效率关键还得看框架和库。
    </p>
    <p>
      微信小程序是支持　typescript 的，官网提供了类型库，可以通过开发者工具直接创建 ts
      项目。百度小程序目前是不支持的，效率就要低很多。
    </p>
    <p>
      微信小程序的数据绑定之前一直是单向的，这个很多时候不太方便，要多写很多代码，好在从 2.9.3
      开始可以双向绑定了，效率上也提升了不少。百度小程序目前还不支持，其它的平台了解的不多。
    </p>
    <p>
      由于小程序都不支持 dom 操作，而是内部提供了一套类 dom
      的查询api，所以有一定的学习成本，也不能轻易的将 html5 程序转换到小程序。同时，各种涉及 dom
      操作的 js 库也无法使用，canvas 库也不行，仅有少数的库专门做了小程序版本，如
      echarts。从这一点来看，效率的影响还是很大的，毕竟项目开发是需要借助于很多开源库的，改造成支持小程序的版本是很耗费时间和精力的。
    </p>
    <p>
      总体上来说，微信小程序的开发效率还行，但是很多现有的 js 库不能利用，开发效率肯定比不上使用 vue
      全家桶开发 web 应用。
    </p>
    <h3>硬件调用和系统原生特性</h3>
    <p>
      这个确实是小程序的优势，微信的小程序有丰富的设备接口，可以调用蓝牙、nfc和感应器等，浏览器中仅个别浏览器可以调用蓝牙。如果有硬件调用方便的需求，就只能放弃纯
      html5 了。
    </p>
    <h3>统计分析</h3>
    <p>
      微信小程序有个数据助手，其它平台的基本上都有，在数据助手中可以查看使用情况，对用户和页面的信息进行统计。
    </p>
    <p>
      <img
        src="/assets/blogs/my-views-on-mini-program/yesterday's-statistics.png"
        alt="小程序统计"
        class="img-fluid"
      />
    </p>
    <p>
      对于 web
      站点，要做这么一套东西，还是有不少的工作量的，数据库的成本也要增加，可以借助于第三方平台，像百度统计之类的。如果是前后端分离，前端
      spa 模式纯静态，可以将前端程序放在 cdn 中，cdn 服务一般都会提供统计信息，但是会弱一些。
    </p>
    <h3>小程序的云开发功能</h3>
    <p>
      微信小程序提供了云开发功能，可以在小程序中使用文件存储、数据库和云函数，现在还提供了云托管和静态网站，百度小程序也有提供支持。相当于后端开发需要用到的技术都给你集成好了，并且还有免费额度，大大降低了成本，你甚至可以零硬件成本起步，非常适合小项目。
    </p>
    <h3>性能</h3>
    <p>
      小程序性能会更好吗？这个可不一定，就我的经验来看，微信小程序流畅度还可以，没有详细测试过，但是百度小程序就比较的拉跨了，明显的卡，页面上的图片资源加载很慢。我之前使用百度官方的工具移植微信小程序到百度，结果百度app中小程序的运行效果非常差，卡顿明显。
    </p>
    <p>
      但是小程序确实比普通的 web 应用更快，这主要是因为运行小程序的 app
      中自带了运行环境，集成了框架和一些 ui
      库，这样小程序本身就可以很小。因此，加载小程序的速度是可以比网页快很多的。但是，web 有 pwa
      技术啊，并且主流浏览器都支持了。win10 自带浏览器 edge 支持将支持 pwa
      的站点添加到桌面，直接独立窗口启动，ios 和安卓也都是支持的，可以让支持 pwa
      的站点像原生应用一样直接从桌面启动，脱机运行，不需要先启动微信这样的小程序容器程序。
    </p>
    <p>
      不仅如此，微软官方还支持将 pwa 直接发布到应用商店：
      <a
        href="https://docs.microsoft.com/zh-cn/microsoft-edge/progressive-web-apps-chromium/how-to/microsoft-store"
        target="_blank"
      >
        将渐进式 Web 应用发布到 Microsoft Store
      </a>
      。
    </p>
    <p>
      相比 html5 ，小程序是没有性能优势的，html5 如果想进一步提升性能，还可以使用 WebAssembly 技术。
    </p>
    <h3>总结</h3>
    <p>小程序最大的价值应该就是其平台本身的生态了，微信小程序就提供了很多便利：</p>
    <ul>
      <li>便捷接入微信登录和微信支付，与视频号，消息等对接</li>
      <li>提供文本和图片内容安全检查功能，这些功能要自己做成本非常高</li>
      <li>提供ai功能，提供视觉算法，支持人脸识别</li>
      <li>有丰富的设备接口，支持对蓝牙、nfc和各种感应器等进行控制</li>
      <li>自带统计分析功能</li>
      <li>提供云开发服务，前期甚至可以零硬件成本，个人觉得云开发不适合大型项目</li>
      <li>内置广告组件，提供了流量变现功能</li>
    </ul>
    <p>
      虽然小程序提供了很多便利，但是个人觉得还是要慎重选择，小程序是需要与平台绑定的，各个平台推出自己的小程序就是要将软件商拉到自己的生态中去。如果你需要小程序给你提供的这些便利，团队没有预算开发各个平台的不同版本
      app，那还是可以考虑的，使用小程序能降低不少成本，甚至还可以省去域名费用。
    </p>
    <p>
      如果你喜欢自由，不愿受制于平台，还是 html5 吧。真有接入微信的需求，还可以考虑在 html5
      的基础上使用 wx-sdk
      接入公共号网页开发，可以做一个兼容层，在非微信内置浏览器内使用或微信调用失败的情况下回退到纯
      html5。
    </p>
    <p>
      个人认为，还是 html5 优先，html5 满足不了需求再考虑小程序和 app，毕竟 html5
      是国际标准，几乎被所有操作系统原生支持，真正的跨平台一码多端，这才是未来。
    </p>
  </BlogLayout>
</template>

<script setup lang="ts">
import BlogLayout from '@/components/blog-layout/BlogLayout.vue'
</script>
